{
  "backend/main.mo": "Main canister implementing products, sales, buyer info, access control, and inventory updates with CRUD and sale-recording APIs.",
  "backend/migration.mo": "Migration module converting old sale records into the new format by adding buyer and creator fields while preserving other data.",
  "feature_evidence.json": "Feature evidence listing feature IDs, related frontend files, components, and test IDs for sales and dashboard functionality.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of all major frontend files including pages, hooks, components, and utilities.",
  "frontend/index.css": "Base Tailwind setup defining custom color variables and light/dark theme tokens for the app.",
  "frontend/index.html": "HTML entry point mounting the React app and loading the main script.",
  "frontend/src/App.tsx": "App root configuring TanStack Router, routes, theme provider, layout, and global toaster.",
  "frontend/src/components/inventory/AdjustStockDialog.tsx": "UI dialog for adjusting product stock, currently showing a placeholder error due to missing backend method.",
  "frontend/src/components/inventory/DeleteProductConfirm.tsx": "Confirmation dialog for deleting a product, showing an error because the backend delete method is not implemented.",
  "frontend/src/components/inventory/ProductFormDialog.tsx": "Dialog component for creating or editing products with form state, validation, and createProduct mutation.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with header, navigation, mobile nav, content container, and footer.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the backend actor based on Internet Identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useDashboard.ts": "Fetches dashboard summary data using the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Handles Internet Identity auth state, login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useProducts.ts": "Provides product list, single product lookup, and product creation via backend actor.",
  "frontend/src/hooks/useSales.ts": "Supports recording sales and fetching all sales or a single sale, with reactive query invalidation.",
  "frontend/src/index.css": "Tailwind base styles and custom color variables for light and dark themes.",
  "frontend/src/lib/format.ts": "Utility functions to format currency and timestamps.",
  "frontend/src/lib/queryKeys.ts": "Defines consistent React Query keys for products, sales, and dashboard.",
  "frontend/src/lib/utils.ts": "Merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "App entry point setting up QueryClient, Internet Identity, and global styles.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard UI showing product totals, low‑stock counts, today's sales, and recent sales using data from dashboard and sales hooks.",
  "frontend/src/pages/InventoryPage.tsx": "Inventory management page with product list, search, and dialogs for adding, editing, adjusting stock, and deleting products.",
  "frontend/src/pages/RecordSalePage.tsx": "Form page for recording a sale with line items, buyer info, validations, and submission via the sales API hook.",
  "frontend/src/pages/SalesHistoryPage.tsx": "Displays sorted sales history with loading/error states and a selectable sale detail panel using sales and product data.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL params, syncing them with sessionStorage, and manipulating hash‑based query parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration setting dark mode, content paths, custom colors, fonts, animations, and container settings using several plugins.",
  "project_state.json": "Defines the project state, feature list, and pending new feature requests related to implementing and displaying sales history functionality."
}