{
  "backend/main.mo": "Motoko canister managing products, sales, and a dashboard summary with CRUD for products and inventory updates during sales.",
  "feature_evidence.json": "Feature evidence report mapping frontend files to implemented features and associated components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file for inventory, sales, and dashboard UI.",
  "frontend/index.css": "Tailwind base and theme variables defining color tokens and dark mode palettes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router setup defining routes for dashboard, inventory, record sale, and sales history inside the app layout.",
  "frontend/src/components/inventory/AdjustStockDialog.tsx": "Dialog UI for adjusting product stock, currently showing an error due to missing backend stock-adjustment method.",
  "frontend/src/components/inventory/DeleteProductConfirm.tsx": "Confirmation dialog for deleting a product, placeholder until backend delete method exists.",
  "frontend/src/components/inventory/ProductFormDialog.tsx": "Dialog for adding or editing products; creation works, updates require a missing backend update method.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with header, navigation (desktop and mobile), content container, and footer.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useDashboard.ts": "Fetches dashboard summary data using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, manages login/logout, identity loading, and wraps the app with an authentication provider.",
  "frontend/src/hooks/useProducts.ts": "Provides hooks for fetching products, fetching a single product, and creating new products with cache invalidation.",
  "frontend/src/hooks/useSales.ts": "Provides a mutation hook to record a sale and refresh related queries.",
  "frontend/src/index.css": "Tailwind CSS configuration defining color variables, themes, and base styles.",
  "frontend/src/lib/queryKeys.ts": "Defines react-query key constants for products, sales, dashboard, and related data.",
  "frontend/src/lib/utils.ts": "Provides a utility function to merge class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and Internet Identity providers.",
  "frontend/src/pages/DashboardPage.tsx": "Displays dashboard metrics, low-stock alerts, and handles loading and error states via useDashboard.",
  "frontend/src/pages/InventoryPage.tsx": "Displays product inventory with search, add/edit, stock adjustment, and delete actions using dialogs and product data hooks.",
  "frontend/src/pages/RecordSalePage.tsx": "Provides a UI to build and submit sales with line items, product selection, quantity validation, and total calculation.",
  "frontend/src/pages/SalesHistoryPage.tsx": "Placeholder page showing sales history is unavailable until backend sales endpoints are implemented.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugin setup for the frontend UI.",
  "project_state.json": "Defines project metadata, feature list, image requirements, and current development state."
}