{
  "kind": "build_request",
  "title": "Implement backend sales history retrieval and show sales history on dashboard",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Extend the backend Sale data to include buyer information and ensure sales are recorded automatically when the existing recordSale function is called, storing: items sold (lineItems), total amount, buyer info, and date/time.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2",
          "msg-3"
        ],
        "quotes": [
          "Also creat sales history feature in this project",
          "items sold, amount, buyer info, date",
          "Automatically by sale record function"
        ]
      },
      "acceptanceCriteria": [
        "Backend Sale type includes a buyerInfo field (at least optional text) in addition to existing timestamp, lineItems, and totalAmount.",
        "recordSale accepts buyer info (and continues to accept optional notes) and persists buyer info into the stored Sale record.",
        "Existing inventory decrement + validation behavior during recordSale remains intact (sale fails if insufficient inventory)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add backend query endpoints to retrieve sales history, including an endpoint to get all sales records (\"getAllSales\") and an endpoint to retrieve a single sale by id (\"getSale\").",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Get allsale"
        ]
      },
      "acceptanceCriteria": [
        "A query method getAllSales() returns a list of Sale records.",
        "A query method getSale(id) returns the matching Sale or null if not found.",
        "Sales are returned with fields necessary for UI display: id, timestamp, totalAmount, buyerInfo, lineItems, and notes."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the frontend sales recording flow to collect buyer information and submit it when recording a sale.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "items sold, amount, buyer info, date"
        ]
      },
      "acceptanceCriteria": [
        "Record Sale page includes an input for buyer information (user-facing label in English).",
        "Submitting a sale calls the updated backend recordSale API including buyer info.",
        "On successful sale record, related React Query caches are invalidated so dashboard and sales history refresh appropriately."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Implement the Sales History UI by replacing the placeholder with a working list view (using getAllSales) and a details view (using getSale) showing date, total amount, buyer info, line items, and notes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-4"
        ],
        "quotes": [
          "Also creat sales history feature in this project",
          "Get allsale"
        ]
      },
      "acceptanceCriteria": [
        "Sales History page no longer shows the placeholder warning about missing backend methods.",
        "Sales History list displays multiple sales with at least: date/time, total amount, and buyer info.",
        "Selecting a sale shows a details section/view including line items (product id, quantity, unit price at sale), notes (if any), and buyer info.",
        "Loading and error states are handled using React Query patterns consistent with the rest of the app."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Show sales history within the existing Dashboard section by adding a \"Recent Sales\" area that lists the most recent sales and links to the full Sales History page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Existing dashboard section"
        ]
      },
      "acceptanceCriteria": [
        "Dashboard page includes a new section/card titled in English (e.g., \"Recent Sales\") showing a list of recent sales (derived from getAllSales).",
        "Each recent sale entry shows at least date/time, total amount, and buyer info (if present).",
        "Dashboard provides a clear navigation link/action to the existing /sales-history route."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in backend/main.mo.",
    "Do not edit files under frontend/src/components/ui (read-only shadcn components).",
    "Do not edit immutable hook/bootstrap paths listed in SYSTEM_CONTEXT (compose around them instead).",
    "Use English for all user-facing UI text."
  ],
  "nonGoals": [
    "Implementing third-party authentication beyond Internet Identity.",
    "Adding external databases or non-IC persistence layers.",
    "Adding real-time updates via WebSockets or similar.",
    "Implementing unrelated inventory CRUD gaps (e.g., product update/delete/stock-adjust methods) unless required to complete sales history retrieval/display."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}