{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Sales history UI and buyer info capture on sale recording",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Collect buyer information on Record Sale and submit it with the sale record call, refreshing relevant cached data.",
      "acceptanceCriteria": [
        "Record Sale page includes an input for buyer information (user-facing label in English).",
        "Submitting a sale calls the updated backend recordSale API including buyer info.",
        "On successful sale record, related React Query caches are invalidated so dashboard and sales history refresh appropriately."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/RecordSalePage.tsx",
          "operation": "modify",
          "description": "Add buyer information inputs (mapped to BuyerInfo: contact + payment) and include buyerInfo in the Record Sale submit payload; use existing shadcn-ui form components (Input/Label/Textarea/Card/etc). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useSales.ts",
          "operation": "modify",
          "description": "Update useRecordSale mutation to accept buyerInfo and call actor.recordSale(lineItems, notes, buyerInfo); on success invalidate products, dashboard, and sales-related React Query keys so dashboard and sales history refresh. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/queryKeys.ts",
          "operation": "modify",
          "description": "Ensure sales-related query keys support list + per-sale detail caching patterns (e.g., list under QUERY_KEYS.sales and detail under QUERY_KEYS.sale with an id segment) so invalidation from recordSale refreshes all relevant views."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Replace Sales History placeholder with a working list and sale details view powered by React Query and the backend sales retrieval methods.",
      "acceptanceCriteria": [
        "Sales History page no longer shows the placeholder warning about missing backend methods.",
        "Sales History list displays multiple sales with at least: date/time, total amount, and buyer info.",
        "Selecting a sale shows a details section/view including line items (product id, quantity, unit price at sale), notes (if any), and buyer info.",
        "Loading and error states are handled using React Query patterns consistent with the rest of the app."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useSales.ts",
          "operation": "modify",
          "description": "Add React Query hooks for sales history retrieval (getAllSales list + getSale detail) that depend on useActor and follow the same enabled/isFetching patterns used elsewhere (e.g., useDashboard)."
        },
        {
          "path": "frontend/src/pages/SalesHistoryPage.tsx",
          "operation": "modify",
          "description": "Implement Sales History list UI using getAllSales and a details UI using getSale; include date/time, total amount, buyer info, line items, and notes; add loading (Skeleton) and error (Alert) states consistent with existing pages; use shadcn-ui Card/Table/Badge/etc for layout. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/format.ts",
          "operation": "create",
          "description": "Add small formatting helpers for consistent UI display (e.g., currency formatting from bigint cents and timestamp-to-readable date/time) used by Sales History and Dashboard."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add a Recent Sales section to the Dashboard showing the most recent sales and linking to the full Sales History route.",
      "acceptanceCriteria": [
        "Dashboard page includes a new section/card titled in English (e.g., \"Recent Sales\") showing a list of recent sales (derived from getAllSales).",
        "Each recent sale entry shows at least date/time, total amount, and buyer info (if present).",
        "Dashboard provides a clear navigation link/action to the existing /sales-history route."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Add a \"Recent Sales\" card/section that queries getAllSales via the sales hooks, sorts by timestamp (most recent first), shows a small list with date/time + total amount + buyer info, and includes a clear navigation action (TanStack Router Link) to /sales-history; handle loading/error states (Skeleton/Alert) consistent with the dashboard. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/format.ts",
          "operation": "modify",
          "description": "Extend formatting helpers as needed for the Dashboard's Recent Sales display (reuse the same formatting as Sales History for date/time and amounts)."
        }
      ]
    }
  ]
}